tap 'homebrew/cask' || true
tap 'homebrew/cask-versions' || true

{{ if eq .chezmoi.os "darwin" -}}
cask_args appdir: '/Applications'
{{- else if eq .chezmoi.os "linux" }}
cask_args appdir: '/opt'
{{- end }}

# Bash
brew 'bash'
brew 'bash-completion'

# Zsh
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Python Tooling
brew 'ruff'
brew 'ty'
brew 'uv'

# Java
{{- if .work }}
cask 'corretto@11'
cask 'corretto@17'
cask 'corretto@21'
cask 'corretto@25'
{{- else }}
brew 'temurin@11'
brew 'temurin@17'
brew 'temurin@21'
brew 'temurin@25'
{{- end }}

# Java Tooling
brew 'gradle'
brew 'gradle-completion'
brew 'jenv'
brew 'maven'

# Kotlin Tooling
brew 'kotlin'

# JavaScript Tooling
brew 'deno'
brew 'node'
brew 'npm'

# Languages
brew 'go'
brew 'kotlin'
brew 'perl'

# GPG for macOS
brew 'gnupg' if OS.mac?
brew 'pinentry-mac' if OS.mac?

# GNU untilities for macOS
brew 'coreutils' if OS.mac?
brew 'gnu-tar' if OS.mac?
brew 'gnu-sed' if OS.mac?

# Git & GitHub
brew 'git'
brew 'git-extras'
brew 'git-filter-repo'
brew 'git-flow'
brew 'git-lfs'

# Docker CLI
brew 'docker'
brew 'docker-completion'
brew 'docker-compose'
brew 'docker-credential-helper'

# Docker Desktop
cask 'docker-desktop'

# Helm
brew 'helm'
brew 'helmenv'
brew 'helmfile'
brew 'helmify'

# Kubernetes
brew 'kind'
brew 'krew'
brew 'kube-ps1'
brew 'kubelogin'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'kyverno'
brew 'minikube'

# Terraform
brew 'terraform'
brew 'tfswitch'

# Other Formulae
brew 'archey4'
brew 'ccat'
brew 'chezmoi'
brew 'cloc'
brew 'cmake'
brew 'coreutils'
brew 'fish'
brew 'fzf'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'imagemagick'
brew 'just'
brew 'jq'
brew 'shellcheck'
brew 'speedtest-cli'
brew 'tmux'
brew 'tree'
brew 'yq'

# Web Browser
{{- if .work }}
cask 'google-chrome'
{{- else }}
cask 'eloston-chromium'
{{- end }}

# Text Editors and IDEs
cask 'jetbrains-toolbox'
cask 'zed'
{{- if .work }}
cask 'lens'
{{- end }}

# LaTeX for macOS
cask 'mactex' if OS.mac?

# 1Password
cask '1password-cli'
cask '1password'

# AI Agents
cask 'claude-code'
